{"architecture":{"class_name":"Functional","config":{"name":"sequential","trainable":true,"layers":[{"module":"keras.layers","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"ragged":false,"name":"input_1"},"registered_name":null,"name":"input_1","inbound_nodes":[]},{"module":"keras.layers","class_name":"Dense","config":{"name":"dense","trainable":true,"dtype":"float32","batch_input_shape":[null,3],"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,3]},"name":"dense","inbound_nodes":[[["input_1",0,0,{}]]]},{"module":"keras.layers","class_name":"Dense","config":{"name":"dense_1","trainable":true,"dtype":"float32","units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,16]},"name":"dense_1","inbound_nodes":[[["dense",0,0,{}]]]},{"module":"keras.layers","class_name":"Dense","config":{"name":"dense_2","trainable":true,"dtype":"float32","units":1,"activation":"linear","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,8]},"name":"dense_2","inbound_nodes":[[["dense_1",0,0,{}]]]}],"input_layers":[["input_1",0,0]],"output_layers":[["dense_2",0,0]]},"keras_version":"2.15.0","backend":"tensorflow"},"image_data_format":"channels_last","input_shapes":[[3]],"output_shapes":[[1]],"tests":[{"inputs":[{"shape":[3],"values":["eMLzv2O9XT5/9oE/"]}],"outputs":[{"shape":[1],"values":["q/s9QA=="]}]}],"trainable_params":{"dense":{"weights":["AtTIvpc2QD5ygrY+G83oPnlR6j6i6mG+iMgpPsIWsr0TU8o+JCGZPp1Vhb7RpRo+O+NWvcq4Sb6qOg4/JyuavkykHL4a5JK+K+eTvn1j3r5DrGA9XwzCPkH9zj1rd98++Sr3vMhbyT4FWIA+M1NhvjJ+Yr6x1gs/Cwm2PUNTZD3Osh6+rUK9PrCP7T6I6nK+5KXQPWRAGT6q9pI9CcI2vrp3hb2NcRk/PvrwPsoj1j5Jbx49uM8wvtn6hz6mWho/"],"bias":["AAAAAHUtzD3ac7k9i7uWPh0elz1hNsQ9kI9RuSLk6j2o6dg9FFKUPZ92wD2kTcM9W+9HPjViAj7Y26c9z5nDPQ=="]},"dense_1":{"weights":["7FvYPswRpT4AUH4+IMIgPdy6tz40p8c+pKSzvsDF6b2F5rS9cEqKvgAjsz7XOwk+MIJavhu56D7BiRI/w3GYPRRTWjswjPG+oczIvkrjBz8QKfG9QqwTPy4ioT7Q5a++OQocv5BcAz52gDo/hZOovpjiTT61Um2+DAsAv9k6D7/GLZE+wMCRPDM5k76YPIo+cKA0Pm7pcb6zMSi9+6eDPmDQ0T7Iweq+pDZdPoE/Kz9gTlA+JgZGvgs3qzuLpxI/OEfevYRouD6jNw0/wHSqvgBwKr6psMw+pEYAP+9F2z7cbQe+YFH/PWf4/j67BLs+VC+NvppraD6FZbI+wU4ivVkkRL6Q03Y+PWGRPR6O7j4oFnS+zbILP6UDxr4NsxA/FYW7PdhomL5C24K+bvb9PVxO1L52CSW+AtsEP8xdrD0spQc+KBcxvtCmdb7p68g+oGWXPSYX5D0qsq0+T048PlQq5T748LU+j19NvTWXDz4gspa9PzBkvf4p6j658UA+O0fkviBWYT0KizE/ZB/gvixU977moQ2/Y6R6PpO/873tJug+kKqHvg9ezj4sOAo/gL7ePK0ZGj8xLIe+GZPxPjGVCD9IX0q+slNvvvgwCz+Ul8G+PwGtPpCLGT93YcS8PK4nPxwWyz5gn5s+YeXwvfggmj6CHNY+VGINvQK8LT8="],"bias":["4qmgPQAAAAB1WEs+h7SePQAAAABndcc9TNWfPaGN0z0="]},"dense_2":{"weights":["n7UEPyvF4L4vI7y+Oq1eP/foxr5iNUQ/p6MVPxHwrj4="],"bias":["lwOcPQ=="]}},"hash":"cb6c0f20e5759a58261464991d3095f65cb75ed6bbacf1237ec0a3edb3cdc0ab"}